In [64]:
%load_ext sql
%config SqlMagic.autocommit=False # for engines that do not support autommit

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [65]:
from sqlalchemy import create_engine
from sqlalchemy.ext.declarative import declarative_base
import csv
import pandas as pd

# had issues with tables persisting using in memory 
db_connection_string = 'sqlite:///temp_db.db'

Base = declarative_base()
engine = create_engine( db_connection_string )
Base.metadata.create_all(engine)

engine

Engine(sqlite:///temp_db.db)

In [66]:
# load data into tables as is 
df = pd.read_csv('./data/titanic/train.csv')
df.to_sql(con=engine, name='train', if_exists='replace')

df1 = pd.read_csv('./data/titanic/gender_submission.csv')
df1.to_sql(con=engine, name='gender_submission', if_exists='replace')

df2 = pd.read_csv('./data/titanic/test.csv')
df2.to_sql(con=engine, name='test', if_exists='replace')

In [67]:
"After this cell its all SQL"

'After this cell its all SQL'

In [68]:
%sql sqlite:///temp_db.db

'Connected: @temp_db.db'

In [69]:
%%sql

select * from train
LIMIT 2

   sqlite:///:memory:
 * sqlite:///temp_db.db
Done.

[(0, 1, 0, 3, 'Braund, Mr. Owen Harris', 'male', 22.0, 1, 0, 'A/5 21171', 7.25, None, 'S'),
 (1, 2, 1, 1, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'female', 38.0, 1, 0, 'PC 17599', 71.2833, 'C85', 'C')]

In [70]:
%%sql

select * from train
LIMIT 2

   sqlite:///:memory:
 * sqlite:///temp_db.db
Done.

[(0, 1, 0, 3, 'Braund, Mr. Owen Harris', 'male', 22.0, 1, 0, 'A/5 21171', 7.25, None, 'S'),
 (1, 2, 1, 1, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'female', 38.0, 1, 0, 'PC 17599', 71.2833, 'C85', 'C')]

In [71]:
%%sql

select * from test
LIMIT 2

   sqlite:///:memory:
 * sqlite:///temp_db.db
Done.

[(0, 892, 3, 'Kelly, Mr. James', 'male', 34.5, 0, 0, '330911', 7.8292, None, 'Q'),
 (1, 893, 3, 'Wilkes, Mrs. James (Ellen Needs)', 'female', 47.0, 1, 0, '363272', 7.0, None, 'S')]